# ResList_Init

## Description
Initialize a categories resource with resources of the specified type. The 'uniqueID' is a string identifier uniquely identifying this control.

```pascal
PROCEDURE ResList_Init(
				uniqueID   : STRING;
				objectType : INTEGER);
```

```python

def vs.ResList_Init(uniqueID, objectType):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|uniqueID|STRING||
|objectType|INTEGER||

## Version
Availability: from Vectorworks 2017
## Category
* Document List Handling